{"data":{"site":{"siteMetadata":{"title":"Rem Lampa: On Web Development, Startups & Film Photography","author":"Rem Lampa"}},"markdownRemark":{"id":"5ce3ec5e-553a-541b-b75c-95bb90c5da1c","excerpt":"There’s a growing consciousness about the failure and myth of the academic system.Don’t believe me? Well, try watching this video and others like it:In fact…","html":"<p>There’s a growing consciousness about the failure and myth of the academic system.</p>\n<p>Don’t believe me? Well, try watching this video and others like it:</p>\n<p>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.39999999999999%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <div class=\"embedVideo-container\">\n            <iframe src=\"https://www.youtube.com/embed/equujEYspCY?rel=0\" class=\"embedVideo-iframe\" style=\"border:0;\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \" allowfullscreen></iframe>\n        </div>\n          </div>\n          </p>\n<p>In fact, some of the top tech companies in the US have stopped requiring degrees.</p>\n<p>Sure, the school system has worked for a few decades. But today, could someone\nhonestly say that having a degree guarantees a fulfilling well-paying job/career\nfor the majority of its holders?</p>\n<p>I happened to catch a morning radio show the other day. And their topic was “I hold\na degree from a top school but my pay is s**t”. The callers, they had stories very\nclose to mine. 10 years or so of being employees, earning 30k-40k a month. Enough\nto live by, but never going to get them anywhere near achieving financial freedom.</p>\n<p>Alumni of UP, Ateneo, La Salle… Engineers, teachers, accountants, doctors… Some\nhave graduate degrees even!</p>\n<p>I know a lot of</p>\n<p>One of the DJs joked that his co-host earns four times their monthly salaries, hosting\nwedding receptions for 2 hours! Four times an engineer’s salary making people play\nmusical chairs!</p>\n<p>We were led to believe that going to school was the only way to have a successful\nlife. You had to have a diploma or you’re deemed as a failure!</p>\n<p>And it has produced a culture of resignation.</p>\n<p>“Di kasi ako Atenista.”</p>\n<p>“Di ako nakatapos kaya hanggang dito na lang ako.”</p>\n<p>“Hayskul lang inabot ko e.”</p>\n<p>Really? That’s it? You don’t finish school, or graduate from a prestigious schoo,\nand you’re suddenly out of options?! Kinda sounds like an elaborate scam, doesn’t\nit? And this is the kind of one-track mindset that has got to end.</p>\n<p>Technology is one of the greatest equalizers. There’s already plenty of options\nout there that don’t need a college diploma: virtual freelancing, vlogging, social\nmedia content creation, livestreaming, professional gaming, online trading, urban\nfarming, founding startups, real-estate flipping, dropshipping, and even building\ntraditional businesses and many others… Don’t tell me these aren’t real jobs/careers,\nbecause I’ll take these “fake jobs” over what society considers “real jobs” any day.\nAnd I know you probably would too.</p>\n<p>Heck, you don’t even have to go to college nowadays to get a college-level\neducation. Many of the Ivy League lectures are now available for FREE on the Internet!\nGranted, you won’t get the diploma along with it, but if you were only after the\nlearnings, you’re all set.</p>\n<p>There’s this one math concept (among many others) that has baffled me since College.\nI decided to take a free online course on Coursera just recently, albeit to study\na different but related topic. Incidentally, right on the first hour, the instructor\nmanaged to discuss that math concept in the most concise terms.</p>\n<p>The instructor made me understand in less than an hour a concept I had difficulty\ngrasping during the past two decades! And I don’t have to pay a single cent (payment\nis optional; I’m still planning to pay since it’s worth every dollar).</p>\n<p>The career I’m currently enjoying is not caused by my engineering degree and license.\nIt is a product of a non-profit educational service, <a href=\"https://www.freecodecamp.org\">freeCodeCamp</a>,\na platform where many people like me learn web development FOR FREE. And freeCodeCamp\nis arguably the largest curated resource of programming knowledge there is today!\nAgain, <em>EVERYTHING FOR FREE</em>!</p>\n<p>Makes you think, with knowledge easily acquired on demand, is the school system finally\nmoving towards a long overdue obsolescence?</p>","frontmatter":{"title":"The Academic Myth","date":"August 02, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/the-academic-myth/","previous":{"fields":{"slug":"/building-private-npm-package-part-i/"},"frontmatter":{"title":"Building a Private NPM Package Part I (Local Development)"}},"next":null}}