{"data":{"site":{"siteMetadata":{"title":"Rem Lampa: On Web Development, Startups & Film Photography","author":"Rem Lampa"}},"markdownRemark":{"id":"5ce3ec5e-553a-541b-b75c-95bb90c5da1c","excerpt":"There’s a growing consciousness about the failure and myth of the academic system.Sure, it has worked for a few decades. But today, could someone honestly say…","html":"<p>There’s a growing consciousness about the failure and myth of the academic system.</p>\n<p>Sure, it has worked for a few decades. But today, could someone honestly say that\nhaving a degree ensures a fulfilling well-paying job/career?</p>\n<p>I happened to catch a morning radio show the other day. And their topic was “I hold\na degree from a top school but my pay is s**t”. The callers, they had stories very\nclose to mine. 10 years or so of being employees, earning 30k-40k a month. Enough\nto live by, but never going to get them anywhere near achieving financial freedom.</p>\n<p>Alumni of UP, Ateneo, La Salle… Engineers, teachers, accountants, doctors… Some have graduate degrees even!</p>\n<p>One of the DJs joked that his co-host earns four times their monthly salaries, hosting wedding receptions for 2 hours! Four times an engineer’s salary making people play musical chairs!</p>\n<p>We were led to believe that going to school was the only way to have a successful life. You had to have a diploma or you’re deemed as a failure!</p>\n<p>And it has produced a culture of resignation.</p>\n<p>“Di kasi ako Atenista.”</p>\n<p>“Di ako nakatapos kaya hanggang dito na lang ako.”</p>\n<p>“Hayskul lang inabot ko e.”</p>\n<p>You don’t finish school, and you’re suddenly out of options.</p>\n<p>That has got to change.</p>","frontmatter":{"title":"The Academic Myth","date":"August 02, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/the-academic-myth/","previous":{"fields":{"slug":"/building-private-npm-package-part-i/"},"frontmatter":{"title":"Building a Private NPM Package Part I (Local Development)"}},"next":null}}